{
  "id": "378292fa-feca-4c27-85c8-bb3568587f7b",
  "filename": "JETIR1801071.pdf",
  "extracted_text": "January 2018, Volume 5, Issue 1 JETIR (ISSN-2349-5162) REVIEW OF JOB PORTAL IN RECUIREMENT PROCESS LIFE CYCLE PAVAN P APARANJI1, DR. JAI PRAKASH TRIPATHI2, Research Scholar, Department of Management, SSSUTMS, Sehore Research Guide, SSSUTMS, Sehore ABSTRACT: An employment portal is a website that facilitates the search for employment and ranges from large, generalized sites to specialized working groups for work categories such as engineering, law, insurance and social work, teaching, developing mobile applications. As cross-sectoral categories such as green jobs, ethical jobs and seasonal work. Users can usually submit their resumes and send them to potential employers and recruiters for review, while employers and recruiters can post job postings and search for potential employees. Niche job directories begin to play a bigger role in providing jobs and employees with more goals for the candidate or employer. Employment Councils, such as For example, airport jobs and federal jobs provide a very specific way to eliminate and reduce the time for the most appropriate role. Keywords: Job portal, Employee selection, job seekers 1. Introduction The digital world has given the recruitment world a new dimension. The World Wide Web or Web 1.0 has reduced search time and costs and offered a transparent information method for candidates (Salmen, 2012). In the early 2000s, corporate sites only acted as the primary source of news about their organizations: recent vacancies, contact information, and organizational changes. The design of Web 1.0 required a unidirectional communication style in which web users could capture location information. Candidates who found vacancies on an organization's website and were interested sent a first e-mail with their resume and a cover letter to the contact person on the website or even on the website. , Publication. Two-way communication was rare because it was an unusual recruiting strategy (Salmen, 2012). Modern web innovations such as Web 2.0. The process of talent acquisition changed forever. This phenomenon is known as \"electronic recruitment\". Generally \"Recruitment and Selection\" is read as a conjoined function. As these two have different responsibilities, it is fair to give separate definitions. Recruitment is not a simple process to put in a simple sentence. Recruitment strategies differ all over the globe, but the common elements are: attracting, finding and procuring. Recruitment is often reported in literature as the process of analysing the job requirements, pooling together a network of qualified candidates and hiring the best fit person for the role in order to gain a competitive advantage (Boxall& Purcell, 2003). Selection is the process of choosing the best fit person for the role from the generated pool of qualified candidates (Bratton & Gold, 2007). These two processes correspond with each other; without recruitment, there is no selection. 2. Literature Review Holm (2012) found that the first task of recruiting is to identify the hiring needs. The organisation relies on Human Resources plots to understand the requirement for long-term and short-term strategies. It is these strategies that will underline the path the organization will utilise. Once hiring needs are identified, the subtask of creating a job description, job specifications and identifying the appropriate pool of applicants is crucial. The one responsible for the job analysis proceeds to review the job elements and essential knowledge and skills for the position. There are many methods, for example; the individual interview and group interview methods, where an individual or group of people currently in a similar role can discuss with Human Resources the job specifications and expectations. When a role does not currently exist, the technical conference method is of value where subject matter experts who have extensive knowledge of the main job duties can give input to the Human Resources (DeCenzo;Robbins;&Verhulst, 2013). This stage is the base of the recruitment process. Holm’s (2012) second stage of the recruiting process is to attract potential ideal candidates by preparing the job announcement. Ideally, the recruitment source and advertisement would be chosen by the industry and position the company is requesting to reach the target audience. In order for a candidate to know about the job, the job announcement must be attractive, loud and clear. The findings from Holm’s (2012) thesis were that there was a difference between the paper-based and the electronic-based recruitment process. From the findings, Holm’s found that the electronic-based recruitment process began with few electronic tools for line managers to commence the recruitment process, e.g. line managers were putting their hiring needs into a Word document and sending it to the responsible recruiter. PROBLEM FORMULATION This research paper discusses about the concept of e- recruitment and the main purpose of this particular research to know about the general impacts of e -recruitment special in the context of job seekers. Job portals may reduce inequality in accessing jobs Based on the baseline data collected for this study, we discuss two important questions for evaluating the importance of job portals. First, we examine whether the full sample of jobseekers in our record also has access to the Internet and work portals. Specifically, we compared different groups of job seekers: younger graduates (those who have not yet used the student work portal) vs. experienced jobseekers (1) (already listed on JETIR1801071 Journal of Emerging Technologies and Innovative Research (JETIR) www.jetir.org 367 January 2018, Volume 5, Issue 1 JETIR (ISSN-2349-5162) the portal); Rural vs urban Job Seekers. Second, we examine whether using the Internet and the job portal correlates with better employment outcomes. \"Job portals have also increased equal access to employment.\" In regards to the first question, an analysis of the baseline data shows that recent graduates – perhaps surprisingly – use the internet significantly less to find jobs than more experienced job seekers, and tend to be registered with fewer portals.The study finds 78% of seasoned job seekers used the internet to search for employment opportunities, versus only 64% of recent graduates. More experience job-seekers were also more likely to register on more than one job portal and relied less on social networks (friends, immediate family, classmates, relatives, etc.) than recent graduates. The latter may reflect differences in perceived value of social networks across difference groups. At the baseline, when asked to rank the usefulness of their social network in finding jobs, recent graduates consistently ranked their social connections higher than more experienced job seekers ranked their own. These same patterns: 1) lower internet usage 2) less knowledge of job portals, and 3) higher reliance on social networks, are also observed among rural job seekers in villages (as compared to those in more densely populated urban areas), and among females (versus males). Table 1 below quantifies these differences: Table 1: Comparing internet usage, portal registration, and social network across different groups of job seekers These results suggest that while the internet and job portals are helping job seekers find employment, the extent to which certain groups utilise these tools differs. More intensive internet job searching also lowers an individual’s reliance on social networks, which could help certain groups overcome inequalities that might otherwise be associated with traditional job search avenues. Conclusion Initial results suggest that using the Internet, and relying on job portals is associated with positive impacts on employment outcomes and higher reservation wages for certain groups over others. This includes more experienced job seekers, urban job seekers, and women. Conversely, recent graduates, women and rural job seekers rely relatively more on social networks, which seem to be less effective. If however, further results do support our initial hypothesis, we believe that job portals may prove a useful tool for increasing the rates of job acquisition among marginalized groups. New recruitment strategies could be targeted towards bringing specific marginalized groups onto the portal, and training them to use the internet and portal efficiently for their job search. Moreover, public vocational training schools can improve their placement rates by assisting their graduates in searching for jobs through the internet and by registering on job portals. References [1] C.R. Kothari , “Research Methodology : Methods and Techniques”, Second (revised) edition, New age publications, India. [2] Goyalshefali (2008) , \"e -recruitment a growing arena of job portals\", hrm review, the icfai university press,pp 66-70. [3] Helen Verhoeven , Sue Williams (2008), “Advantages and Disadvantages of Internet Recruitment: A UK Study into Employers’ Perceptions”, International Review of Business Research Papers,Vol.4 No. 1 [4] Mohammad Rezaul Karim, Md. Shelim Miah, AsmaKhatun(2015), “e-recruitment in practice: a study on jobseekers’ perception in Bangladesh” Global Disclosure of Economics and Business, Volume 4, No 1. 5. Naveed r. khan, marinah awing, arsalanmujahidghouri (2013), “impact of e-recruitment and jobseekers perception on intention to pursue the jobs”, management& marketing, volume xi. [5] PavitraDhamija(2012), “e-recruitment: a roadmap towards e- human resource management” ,Vol.– III, Issue–3(2). [6] Dutta, D. (2014). Tweet Your Tune - Social Media, the New Pied Piper in Talent Acquisition. Vikalpa: The Journal for Decision Makers, 39(3), 93-104 [7] Fayyazi, M. &Afshar, Z. (2014). E- Recruitment in Iranian Bank and Insurance Industry. New Marketing Research Journal, Special Issue 2014.69-78. [8] Galpin, T., Whittington, J. L., &Maellaro, R. (2012). Identifying, Retaining and ReEngaging Key Talent during Mergers and Acquisitions: A Best Practices Framework. People & Strategy, 35(1), 42-48. [9] Garcia- Izquierdo, A. L., Aguinis, H. & Ramos- Villagrasa, P.J. (2010). Science Research Gap in e- recruitment. International Journal of Selection and Assessment, 18(4). [10] Girard, A., &Fallery, B. (2010). Human Resource Management on Internet: New Perspectives. Journal of Contemporary Management Research, 4(2), 1-14. [11] Heid, M. C., & Murphy, W. (2007). It's 2012 Do You Know Where the Talent Is? Financial Executive, 23(10), 28-31. [12] Holm, A. B. (2012). E-recruitment: Towards a Ubiquitous Recruitment Process and Candidate Relationship Management. German Journal of Research in Human Resource Management. pp. 241-259 JETIR1801071 Journal of Emerging Technologies and Innovative Research (JETIR) www.jetir.org 368 January 2018, Volume 5, Issue 1 JETIR (ISSN-2349-5162) [13] Kar, A., & Bhattacharya, S. (2009). E-Recruitment and Customer Satisfaction: An Empirical Study in and Around Kolkata. ICFAI Journal of Management Research, 8(2), 34-54. [14] Parry, E. & Tyson, S. (2008).An analysis of the use and success of online recruitment methods in the UK. Human Resource Management Journal, Vol 18, no 3, 2008, pages 257–274. [15] P. Sanjeevikumar Vengatesan K, R. P. Singh, S. B. Mahajan,” Statistical Analysis of Gene Expression Data Using Biclustering Coherent Column”, International Journal of Pure and Applied Mathematics, Volume 114, Issue 9, Pages 447-454 [16] P. Jaspreetkuar Sayyad Samee, Sarfaraz Khan, K. Vengatesan, Mahajan Sagar Bhaskar, P. Sanjeevikumar,” Smart City Automatic Garbage Collecting System for a Better Tomorrow”, International Journal of Pure and Applied Mathematics, Volume 114, Issue 9, Pages 455-463 [17] Vengatesan K., Mahajan S.B., Sanjeevikumar P., Mangrule R., Kala V., Pragadeeswaran (2018) Performance Analysis of Gene Expression Data Using Mann–Whitney U Test. In: Konkani A., Bera R., Paul S. (eds) Advances in Systems, Control and Automation. Lecture Notes in Electrical Engineering, vol 442. Springer, Singapore. [18] Vengatesan K., Mahajan S.B., Sanjeevikumar P., Moin S. (2018) The Performance Enhancement of Statistically Significant Bicluster Using Analysis of Variance. In: Konkani A., Bera R., Paul S. (eds) Advances in Systems, Control and Automation. Lecture Notes in Electrical Engineering, vol 442. Springer, Singapore [19] Vengatesan, K., and S. Selvarajan. \"Improved T-Cluster based scheme for combination gene scale expression data.\" In Radar, Communication and Computing (ICRCC), 2012 International Conference on, pp. 131-136. IEEE, 2012 [20] K.Vengatesan, S.Selvarajan,“The performance Analysis of Microarray Data using Occurrence Clustering” International Journal of Mathematical Science and Engineering, Issue-2, Volume-3, December 2014,pp 69-75. [21] Kalaivanan, M., and K. Vengatesan. \"Recommendation system based on statistical analysis of ranking from user.\" International Conference on Information Communication and Embedded Systems (ICICES), , pp. 479-484. IEEE, 2013. JETIR1801071 Journal of Emerging Technologies and Innovative Research (JETIR) www.jetir.org 369",
  "skills": [
    "Git",
    "Rest",
    "Ai",
    "Spring"
  ],
  "experience_years": null,
  "education": [
    "Engineering"
  ],
  "email": null,
  "similarity_score": 0.8538816273212433,
  "timestamp": "2025-11-28 15:59:22.345819"
}