{
  "id": "4459910c-b3c4-4fd7-88f7-e0c5a410e376",
  "filename": "ilovepdf_merged.pdf",
  "extracted_text": "VISVESVARAYA TECHNOLOGICAL UNIVERSITY BELAGAVI – 590 018 A Report of Mini-Project (BCI586) On Crop Recommendation System Using Machine Learning Submitted to Visvesvaraya Technological University Belagavi. For the Degree of BACHELOR OF ENGINEERING IN COMPUTER SCIENCE AND ENGINEERING (Artificial Intelligence & Machine Learning) By 1VA22CI069 Preksha GP 1VA22CI081 Sakshi Shanbhag 1VA22CI087 Shreya BC 1VA22CI093 Sneha T Under the Guidance of Dr. T G Manjunath Professor & HOD Department of Computer Science & Engineering (AI & ML) Sai Vidya Institute of Technology Bengaluru – 560 064. AY: 2024 – 25 SAI VIDYA INSTITUTE OF TECHNOLOGY BENGALURU – 560 064 DEPARTMENT OF COMPUTER SCIENCE AND ENGINEERING (Artificial Intelligence & Machine Learning) CERTIFICATE This is to certify that the report for the Mini Project titled Crop Recommendation System using Machine Learning is a bonafide work carried out by Preksha GP (1VA22CI069), Sakshi Shanbhag (1VA22CI081), Shreya BC (1VA22CI087), Sneha T (1VA22CI093) in partial fulfillment for the award of Bachelor of Engineering in Computer Science and Engineering (Artificial Intelligence & Machine Learning) under Visvesvaraya Technological University, Belagavi during the year 2024-25. It is certified that all the corrections/suggestions have been incorporated in the report. The report has been approved as it satisfies the academic requirements in respect of Mini Project work (BCI586) prescribed for the said degree. Project Guide Project Coordinator Head of the Department Dr.T G Manjunath Prof.Baswanthrao Patil Dr. T G Manjunath Professor & Head Assistant Professor Professor & Head Dept. of CSE (AI & ML) Dept. of CSE (AI & ML) Dept. of CSE (AI & ML) Acknowledgement I would like to express my sincere thanks to The Trustees, and The Principal Dr. M S Ganesha Prasad, Sai Vidya Institute of Technology, Bangalore for giving permission to carry out our Project. I express my sincere gratitude to our guide Dr. T G Manjunath, Professor & Head, Dept. of CSE (AI & ML) Sai Vidya Institute of Technology, Bengaluru, for his valuable guidance, suggestions and motivation for our Mini Project and Project Coordinator, Prof. Baswanthrao Patil, Assistant Professor, Dept. of CSE (AI & ML), Sai Vidya Institute of Technology, Bangalore for their technical support to implement our Mini Project. Finally, I would like to thank all Professors of Department of CSE (AI & ML), Sai Vidya Institute of Technology, Bengaluru, for their support. 1VA22CI069 Preksha GP 1VA22CI081 Sakshi Shanbhag 1VA22CI087 Shreya BC 1VA22CI093 Sneha T BCI586 Crop Recommendation System using ML TABLE OF CONTENT SN NO . TOPIC PAGE NO. 1. Introduction 2 2. Literature Survey 5 2.1 Literature Review 6 2.2 Problem Statement 7 2.3Objective of Proposed System 3. Methodology and Proposed system 3.1 Methodology 8 3.1.1 Collecting the Datasets 3.1.2 Pre -Processing 3.1.3 Feature Extraction 3.1.4 Applied various ML Algorithms 3.1.5 Recommendation System 3.1.6 Recommended Crop 3.2 Proposed System 15 4. Machine Learning Model 4.1 Algorithm Used 17 4.2 Packages 18 5. Training And Testing 5.1 Training 20 5.2 Testing 22 6. Results And Discussions 24 7. Conclusion And Future scope 26 7.1 Conclusion 27 7.2 Future Scope 8. References 28 Dept. of CSE (AI & ML) 1 BCI586 Crop Recommendation System using ML CHAPTER 1: INTRODUCTION Agriculture, the backbone of many economies, faces challenges such as climate change, population growth, and resource limitations. To address these challenges, technological advancements are becoming increasingly vital. One such advancement is the use of machine learning (ML) for crop recommendation systems. These systems leverage vast amounts of data to provide farmers with precise recommendations on the most suitable crops to plant under specific conditions, ultimately enhancing productivity and sustainability. Traditionally, farmers rely on their knowledge and experience to decide which crops to plant. While valuable, this approach can be limited by subjective biases and the inability to process large datasets. Crop recommendation systems powered by ML offer a data-driven alternative, analyzing various factors such as soil type, climate conditions, historical crop performance, and market demand. This allows for more informed decision-making, reducing the risk of poor crop choices and optimizing resource use. Several ML techniques are employed in crop recommendation systems, each with unique strengths. For example, Random Forest algorithms, known for their robustness and accuracy, can handle large datasets and complex relationships. Support Vector Machines (SVM) are effective for classification tasks, while Neural Networks can model intricate patterns and interactions within the data. K-Nearest Neighbors (KNN), although simple, is useful for its ease of implementation and interpretation. These algorithms can be tailored to specific agricultural contexts to enhance their predictive capabilities. The foundation of any successful ML model is high-quality data. For crop recommendation, this involves collecting data on soil properties (such as pH, nitrogen, phosphorus, potassium levels), weather patterns Dept. of CSE (AI & ML) 2 BCI586 Crop Recommendation System using ML (temperature, humidity, rainfall), and historical crop yields. Once collected, the data must be cleaned, standardized, and sometimes transformed to fit the requirements of the ML algorithms. This preprocessing step is crucial to ensure the accuracy and reliability of the predictions. After the data has been preprocessed, it is used to train the ML models. During training, the models learn to identify patterns and relationships within the data that predict optimal crop choices. Once trained, these models are deployed through user-friendly applications accessible to farmers. These applications can take various forms, such as mobile apps, web portals, or integrated systems within existing agricultural management software. They provide real-time recommendations, allowing farmers to make informed decisions quickly and efficiently. The benefits of ML-based crop recommendation systems are manifold. They increase agricultural productivity by ensuring that crops are planted under optimal conditions. They also promote resource efficiency, reducing the need for excessive water, fertilizers, and pesticides. Furthermore, by enabling farmers to adapt to changing environmental conditions and market demands, these systems contribute to greater economic stability and food security. Despite their potential, crop recommendation systems face several challenges. Data quality and availability can be significant hurdles, particularly in regions with limited technological infrastructure. Ensuring Dept. of CSE (AI & ML) 3 BCI586 Crop Recommendation System using ML the models' accuracy and robustness requires continuous updates and validation, which can be resource-intensive. Additionally, there is a need for user-friendly interfaces that are accessible to farmers with varying levels of technological literacy. Precision agriculture involves \"site-specific\" farming technology, enabling efficient input and output management, and helping farmers make better decisions. Despite its improvements, precision agriculture still faces certain issues. There are numerous systems available that suggest inputs for specific farmland, including crops, fertilizers, and farming techniques. One major area within precision agriculture is the recommendation of crops, which depends on various parameters. The goal of precision agriculture is to identify these parameters in a site-specific manner, thus addressing crop selection challenges. While the \"site-specific\" approach has enhanced results, there is still a need for supervision to ensure the accuracy of these systems. Not all precision agriculture systems provide precise results, and inaccuracies can lead to significant material and financial losses in agriculture. Therefore, ongoing research aims to develop accurate and efficient crop prediction models. The future of crop recommendation systems lies in the integration of more advanced technologies and broader datasets. For example, combining ML with remote sensing technologies, such as satellite imagery, can provide real-time monitoring and recommendations at a larger scale. Advances in Internet of Things (IoT) devices can facilitate seamless data collection and integration. Moreover, collaborative platforms that aggregate data from multiple sources can enhance the models' predictive accuracy and applicability. As these technologies evolve, crop recommendation systems will become even more powerful tools for modern agriculture. Dept. of CSE (AI & ML) 4 BCI586 Crop Recommendation System using ML CHAPTER 2: LITERATURE SURVEY 2.1 LITERATURE REVIEW This section reviews the key contributions in this field, highlighting the methodologies, algorithms, and findings of notable research works. A study by Mahesh V. Korde and colleagues explore a system with machine learning to provide real-time crop suggestions based on soil characteristics. The system analyzes key soil parameters such as nitrogen, potassium, phosphorus, pH, and environmental factors like rainfall, humidity, and temperature. This approach aims to offer personalized crop recommendations to farmers, helping them make informed decisions about crop selection, resource utilization, and sustainable farming methods. Another research by Ms. Sarika Gambhir and her team focuses on predicting the right crop using parameters like district, rainfall, temperature, and area. They employ techniques like Ridge Regression and Classifier to analyze different datasets and improve accuracy. This method provides valuable insights to farmers, assisting them in making decisions about crop cultivation. Prof. Sonawane Minakshi and her team review various machine learning algorithms used in crop recommendation systems. They discuss the importance of these systems in modern farming, highlighting how they enhance agricultural productivity, optimize resource management, and contribute to sustainable farming practices. The study covers different datasets, evaluation criteria, and case studies to illustrate the capabilities and limitations of existing systems. These studies highlight the potential of machine learning in revolutionizing agriculture by providing data-driven insights and recommendations to farmers. This approach not only enhances productivity but also promotes sustainable farming practices. Dept. of CSE (AI & ML) 5 BCI586 Crop Recommendation System using ML 2.2 PROBLEM STATEMENT ⮚ Agriculture plays a pivotal role in India's economy and employment. One of the significant challenges faced by Indian farmers is the selection of crops that are not compatible with the specific requirements of the soil, leading to reduced productivity and financial setbacks. ⮚ Many farmers lack access to comprehensive information, leading to poor crop choices. ⮚ Crop recommendation systems using machine learning can improve farmers' decisions. ⮚ Incorrect planting or harvesting times can negatively impact crop yield and quality. ⮚ Soil deficiencies in essential nutrients like nitrogen, phosphorus, and potassium can reduce yields. ⮚ Continuous monocropping and poor agricultural practices degrade soil quality. ⮚ Sustainable soil management practices can enhance fertility and reduce crop failure risk. ⮚ Advancements in soil testing technologies provide real-time insights and actionable recommendations for better soil health management. Dept. of CSE (AI & ML) 6 BCI586 Crop Recommendation System using ML 2.3 OBJECTIVE OF THE PROPOSED SYSTEM The major objectives of the research are as follows: ⮚ A crop recommendation system uses machine learning to help farmers select suitable crops based on environmental and soil factors. By analyzing real-time weather data, including temperature, rainfall, and humidity, it predicts weather patterns. This ensures the recommended crops are well-suited to the expected climatic conditions, improving their chances of success. ⮚ Soil moisture and nutrients are crucial for crop growth. Real-time soil moisture data can be collected using IoT sensors or satellites, while models like Support Vector Regression predict future trends. Based on this, the system recommends crops that suit the moisture conditions, optimizing water use. ⮚ Soil nutrients (nitrogen, phosphorus, potassium) are assessed through soil testing. Machine learning algorithms like Random Forest or Gradient Boosting evaluate the nutrient profile to suggest suitable crops, reducing the need for excessive fertilizers. ⮚ Integrating weather forecasts, soil moisture, and nutrient data, the system provides tailored crop recommendations. Ensemble models such as Random Forest enhance accuracy and reliability. This approach boosts crop yield, optimizes resource use, mitigates weather risks, and promotes sustainable farming practices, making it a valuable tool for modern agriculture. Dept. of CSE (AI & ML) 7 BCI586 Crop Recommendation System using ML CHAPTER 3: METHODOLOGY AND PROPOSED SYSTEM 3.1 METHODOLOGY The proposed crop recommendation system follows a structured methodology, starting with the collection of datasets on soil and climate factors like nitrogen, pH, temperature, and rainfall from historical data. After pre-processing to remove noise, feature extraction identifies the key attributes needed for analysis. The algorithm applied after checking the accuracy of predicting the suitable crop for the given condition is Random Forest Classifier. These models power a recommendation system that suggests the best crop based on input condition. Fig 3.1 Methodology of the Proposed System In our framework, we have proposed a procedure that is separated into various stages as appeared in Figure 4.1. The five phases are as per the following: 1) Collection of Datasets 2) Pre-processing (Noise Removal) 3) Feature Extraction Dept. of CSE (AI & ML) 8 BCI586 Crop Recommendation System using ML 4) Applied Various Machine Learning Algorithm 5) Recommendation System 6) Recommended Crop 3.1.1 COLLECTING THE DATASETS The dataset used for this study includes soil-specific attributes collected from Kaggle, along with additional general crop data from similar online sources. The crops included in the model are rice, maize, chickpea, kidney beans, pigeon peas, moth beans, mungbean, black gram, lentil, pomegranate, banana, mango, grapes, watermelon, muskmelon, apple, orange, papaya, coconut, cotton, jute, and coffee. The dataset provides an analysis of the number of instances available for each crop in the training set. The attributes considered in this analysis include Nitrogen (N), Potassium (K), Phosphorus (P), Temperature, Humidity, pH, and Rainfall. These soil parameters play a crucial role in a crop's ability to absorb water and nutrients from the soil. For optimal crop growth, the soil must create a suitable environment for the plants to thrive. Soil provides the foundation for the roots, enabling them to anchor the plant. ● Nitrogen is essential for leaf growth. ● Phosphorus supports root development and flower and fruit formation. ● Potassium is vital for the plant's overall functions. ● Temperature is a key factor affecting plant growth, influencing development alongside light, carbon dioxide levels, air humidity, and nutrient availability. ● Humidity affects water relations in plants and can influence leaf growth, photosynthesis, pollination, disease occurrence, and overall yield. ● The pH level of the soil determines the availability of nutrients and Dept. of CSE (AI & ML) 9 BCI586 Crop Recommendation System using ML impacts soil microorganisms and exchangeable aluminum levels. ● Rainfall influences crop growth speed and the timing of harvest. A balance of rainfall and proper irrigation can result in faster plant growth, reducing germination time and the duration from seeding to harvest. Fig 3.2 Dataset Figure 3.3 Correlation Matrix 3.1.2 PRE-PROCESSING Data preprocessing is a crucial step in any research involving machine learning. It involves transforming and cleaning raw data to ensure it is suitable for analysis. In this study, various data pre-processing techniques Dept. of CSE (AI & ML) 10 BCI586 Crop Recommendation System using ML were applied, such as removing noise, handling missing values, eliminating duplicates, resolving inconsistencies, and discarding irrelevant features. These steps help enhance the quality and usability of the dataset. Pre-processing also improves the performance and interpretability of machine learning models by scaling, normalizing, and encoding the data. For crop recommendation systems, data pre-processing is essential to address the challenges and limitations inherent in the dataset. It ensures that the model is trained on accurate and high-quality data, which is critical for reliable predictions. Additionally, proper pre-processing helps in designing an efficient training model and minimizes issues like overfitting, ultimately improving the overall accuracy and robustness of the system. 3.1.3 FEATURE EXTRACTION This step focuses on identifying and utilizing the most relevant attributes from the dataset. By removing irrelevant and redundant information, the dataset is refined to enhance the application of classifiers. 3.1.4 APPLIED VARIOUS MACHINE LEARNING ALGORITHMS In this project, we applied several machine learning algorithms to develop an effective crop recommendation system. The algorithms used include Random Forest, Support Vector Machine (SVM), K-Nearest Neighbors (KNN), and Gradient Boosting. Each algorithm was selected based on its ability to handle the complexity of the data and provide accurate predictions. 1. Random Forest: This ensemble learning method combines multiple decision trees to improve prediction accuracy. It is particularly effective in handling large datasets and reducing overfitting. 2. Support Vector Machine (SVM): SVM is a supervised learning model that classifies crops based on input features. It is known for its robustness in high-dimensional spaces and its ability to find the optimal hyperplane for classification. 3. K-Nearest Neighbors (KNN): KNN is a simple yet powerful algorithm that classifies crops based on the closest data points in the feature Dept. of CSE (AI & ML) 11 BCI586 Crop Recommendation System using ML space. It is easy to implement and effective for small to medium-sized datasets. 4. Gradient Boosting: This ensemble technique builds models sequentially to correct errors made by previous models. It is highly effective in improving prediction accuracy and handling complex data patterns. Each algorithm was trained and evaluated using a dataset containing soil characteristics, environmental factors, and historical crop yield data. The performance of the models was assessed using metrics such as accuracy, precision, recall, and F1-score. The best-performing model was selected for deployment in the crop recommendation system. Figure 3.4 Checking of Accuracy Score Figure 3.5 Accuracy score of each Model Dept. of CSE (AI & ML) 12 BCI586 Crop Recommendation System using ML 3.1.5 RECOMMENDATION SYSTEM These models drive the recommendation system by analyzing various input conditions, such as soil type, weather patterns, and historical crop performance. Using this data, the models identify patterns and correlations to predict the most suitable crop for a given environment. ML algorithms, like Random Forest or Neural Networks, process these inputs and generate recommendations by evaluating the best crop options for maximizing yield and sustainability. This approach ensures that the suggestions are data-driven, accurate, and tailored to specific farming conditions, ultimately helping farmers make informed decisions. 3.1.5.1 FRONT END OF CROP RECOMMENDATION SYSTEM The front end of the crop recommendation system is designed to be user-friendly & accessible to farmers. It allows users to input their soil & environmental data, such as soil nutrient levels, pH, temperature, rainfall, and humidity. The interface then processes this data and, based on the trained ML model, provides personalized crop recommendations. This helps farmers make informed decisions on the best crops to plant, improving yield & sustainability. The front end may also include features such as data visualization, historical yield analysis, & the option to receive updates or alerts based on changing environmental conditions. Fig 3.6 Front end of crop recommendation system Dept. of CSE (AI & ML) 13 BCI586 Crop Recommendation System using ML 3.1.6.2 BACK END OF CROP RECOMMENDATION SYSTEM The backend of the crop recommendation system handles the core computational tasks, including data collection, preprocessing, model training, and prediction. It involves setting up a server (for example, using Flask) to handle incoming requests from the frontend. When a user submits their soil and environmental data through the frontend, the backend processes this data. The data preprocessing steps include cleaning, handling missing values, and normalizing the input data. Relevant features are then selected, and these features are fed into a trained machine learning model to make predictions. The backend also maps the model's output to user-friendly crop recommendations. Finally, the backend sends the prediction results back to the frontend, where they are displayed to the user. Fig 3.7 Back end of crop recommendation system Dept. of CSE (AI & ML) 14 BCI586 Crop Recommendation System using ML 3.1.7 RECOMMENDED CROP The recommended crop step starts by collecting data on soil type, pH, moisture, climate, and market trends. Machine learning models like Random Forest analyze this data to predict the best crops based on past performance in similar conditions. The system generates a ranked list of recommended crops, optimized for yield, sustainability, and market demand. It adapts to real-time changes in weather or market conditions and provides farmers with clear, actionable recommendations, including expected yield, planting times, and market prices through an easy-to-use interface. 3.2 PROPOSED SYSTEM Proposed System for Crop Recommendation Using Machine Learning 1. Data Processing Unit: ○ Data Collection: Aggregate data from IoT sensors and other sources (e.g., weather stations, agricultural databases) into a centralized database. ○ Data Preprocessing: Clean and preprocess the data to handle missing values, remove outliers, and normalize the data. This step ensures the data is suitable for machine learning algorithms. ○ Feature Selection: Identify the most relevant features that influence crop yield and suitability using techniques like correlation analysis and feature importance scores from machine learning models. 2. Machine Learning Model: ○ Model Selection: Choose appropriate machine learning algorithms for the crop recommendation system. Commonly used algorithms include Random Forest, Support Vector Machine (SVM), K-Nearest Neighbors (KNN), and Gradient Boosting. ○ Model Training: Train the selected machine learning models Dept. of CSE (AI & ML) 15 BCI586 Crop Recommendation System using ML using the preprocessed data. Split the data into training and testing sets to evaluate the model's performance. ○ Model Evaluation: Evaluate the trained models using metrics like accuracy, precision, recall, and F1-score. Select the model with the best performance for the crop recommendation system. 3. User Interface: ○ Mobile App/Web Application: Develop a user-friendly interface that allows farmers to input their soil and environmental data. The interface should display the recommended crops based on the machine learning model's predictions. ○ Visualization: Provide visual representations of the data and recommendations, such as graphs and charts, to help farmers understand the insights and make informed decisions. 4. Scalability and Deployment: ○ Cloud Infrastructure: Utilize cloud infrastructure to store and process large amounts of data, ensuring the system can handle multiple users simultaneously. ○ Scalability: Design the system to be scalable, allowing it to support farmers across different regions and agricultural practices. ○ Deployment: Deploy the system in a real-world agricultural setting, providing farmers with access to the crop recommendation system through mobile devices or web browsers. This proposed system aims to provide accurate and personalized crop recommendations to farmers, helping them make informed decisions and improve agricultural productivity. By leveraging IoT and machine learning technologies, the system can offer data-driven insights and promote sustainable farming practices. Dept. of CSE (AI & ML) 16 BCI586 Crop Recommendation System using ML CHAPTER 4: MACHINE LEARNING MODEL 4.1 ALGORITHM USED RANDOM FOREST: Random Forest is a supervised machine learning algorithm used for both classification and regression tasks. It is based on the principle of ensemble learning, which combines multiple models to solve complex problems and improve performance. The algorithm builds multiple decision trees during training. Each tree uses a random subset of features to ensure diverse predictions and prevent dominance by any single tree. Random Forest also applies bagging, training each tree on a randomly sampled subset of the data for added robustness. For prediction, Random Forest aggregates results from all trees. In classification tasks, it determines the final output through majority voting, selecting the most frequent prediction. In regression tasks, it computes the average of all tree predictions. This collective decision-making improves accuracy, prevents overfitting, and ensures balanced results, making Random Forest a robust and reliable algorithm. Fig 4.1 Random Forest Dept. of CSE (AI & ML) 17 BCI586 Crop Recommendation System using ML We have applied Random Forest (RF) in our model as: (i) Importing library RandomForestClassifier from sklearn.ensemble Class (ii) Now we create RF classifier object (iii) In the last we fit our data Figure 4.2 Random Forest Model 4.2 PACKAGES 1. Pandas: Pandas is a Python library that provides fast, flexible, and user-friendly data structures for working with structured data like tables, multidimensional arrays, and time-series datasets. It serves as a key tool for real-world data analysis in Python, offering versatility and robustness. Built on top of NumPy, Pandas integrates seamlessly into scientific workflows and is optimized for high performance. 2. NumPy: NumPy is a Python library designed for handling large, multidimensional arrays and matrices, along with high-level mathematical functions. It provides efficient data structures and optimized functions to enhance performance, especially when working with CPython. Similar to MATLAB, NumPy enables efficient operations on arrays and matrices, while integrating with complementary libraries like SciPy and Matplotlib for scientific computing and visualization. 3. Scikit-learn: Scikit-learn is a Python-based open-source machine learning library offering algorithms for classification, regression, clustering, and more. Key algorithms include support vector machines, random forests, gradient boosting, k-means clustering, and Dept. of CSE (AI & ML) 18 BCI586 Crop Recommendation System using ML DBSCAN. Designed to work seamlessly with NumPy and SciPy, Scikit-learn is a powerful tool for machine learning applications in Python. Fig 4.3 Calling the packages Dept. of CSE (AI & ML) 19 BCI586 Crop Recommendation System using ML CHAPTER 5: TRAINING AND TESTING 5.1 TRAINING Training the model is crucial for achieving precise and dependable predictions, which in turn enhances farming methods. To conduct a comparative analysis, several machine learning algorithms are usually evaluated. Popular options include logistic regression, decision trees, random forests, and support vector machines, among others. The choice of models should be based on factors such as the nature of the problem, the need for high accuracy, efficiency, and the ability to prevent overfitting. The goal of the comparative analysis is to identify the algorithm(s) that deliver the highest performance in terms of prediction accuracy and the ability to generalize well to new data. Fig 5.1 Graphical representation of accuracy score of different models Dept. of CSE (AI & ML) 20 BCI586 Crop Recommendation System using ML Training a crop recommendation system involves several critical steps. Initially, the process begins with data collection where information about soil types, weather conditions, and other environmental factors is gathered. Once the data is collected, it undergoes preprocessing to clean, normalize, and select relevant features, ensuring it is ready for model training. In the model training phase, various machine learning algorithms such as Random Forest or Support Vector Machines are chosen based on the problem's requirements. The training involves feeding the cleaned data into the model, allowing it to learn patterns and relationships between input features and the target variable, which is the crop type. To optimize the model, hyperparameters are tuned using techniques like grid search or random search, and cross-validation is employed to ensure the model generalizes well. Fig 5.2: Train Test Split Fig 5.3 Scale the features using MinMaxScaler and Standard Scaler Dept. of CSE (AI & ML) 21 BCI586 Crop Recommendation System using ML Fig 5.4 confusion matrix for RandomForestClassifier 5.2 TESTING In the process of developing a crop recommendation system using the Random Forest algorithm, the dataset is first split into two parts: a training set and a testing set. Typically, 70-80% of the dataset is allocated to the training set, while the remaining 20-30% is reserved for testing the model's performance. During the model training phase, the Random Forest model is trained using the training set, where it learns the relationships between the input features (such as soil characteristics and environmental factors) and the target variable (crop suitability). Once trained, the model is tested by predicting crop suitability on the testing set, generating predictions based on the input features of the testing data. The model's performance is evaluated using various metrics, including accuracy (the proportion of correct predictions out of the total number of predictions), precision (the proportion of true positive predictions out of the total positive predictions), recall (the proportion of true positive predictions out of the total actual positives), and F1-score (the harmonic mean of Dept. of CSE (AI & ML) 22 BCI586 Crop Recommendation System using ML precision and recall, providing a balanced measure of the model's performance). Additionally, a confusion matrix is generated to visualize the model's performance, showing the number of true positives, true negatives, false positives, and false negatives, which helps in understanding the model's strengths and weaknesses. Based on the evaluation metrics and cross-validation results, the best-performing Random Forest model is selected for use in the crop recommendation system. Fig 5.5 Predictive System Fig 5.6 Testing Model Dept. of CSE (AI & ML) 23 BCI586 Crop Recommendation System using ML CHAPTER 6: RESULTS AND DISCUSSIONS ✔ Machine learning techniques are widely applied in various aspects of agriculture. One such application is developing a system to predict crop production based on historical data. This involves using advanced data processing techniques to forecast agricultural production patterns. ✔ Currently, random forest algorithms are effectively employed to classify and predict crops with high accuracy. In agriculture, such predictive systems are essential for estimating yields, as higher accuracy in predictions translates to better planning and higher outputs. ✔ The proposed methods aim to help farmers understand the requirements and costs associated with different crops, enabling them to make informed decisions about what to cultivate. ✔ These systems can also identify additional crops that can be grown economically and efficiently, ultimately contributing to agricultural diversification. By leveraging this technology, a wide range of crops can be cultivated successfully. For instance, Indian farmers can benefit significantly from precise crop yield predictions tailored to different regions of the country, enhancing agricultural productivity and profitability. Dept. of CSE (AI & ML) 24 BCI586 Crop Recommendation System using ML Fig 6.1 Crop Prediction The above image depicts a web page titled \"Crop Recommendation System,\" which features input fields where users can enter specific agricultural parameters such as Nitrogen, Phosphorus, Potassium, Temperature in °C, Humidity in %, pH value, and Rainfall in mm. This layout aims to provide users with a straightforward interface for inputting relevant data and receiving crop recommendations. Fig 6.2 Crop Recommendation Dept. of CSE (AI & ML) 25 BCI586 Crop Recommendation System using ML The image shows a user interface for a crop recommendation system. The interface includes input fields for various agricultural parameters for example: Nitrogen (102), Phosphorus (25), Potassium (50), Temperature (28.2), Humidity (92.9%), pH (6), and Rainfall (20.4mm).The recommendation card states: Recommend Crop for cultivation is : Muskmelon is the best crop to be cultivated right there. Dept. of CSE (AI & ML) 26 BCI586 Crop Recommendation System using ML CHAPTER 7: CONCLUSION AND FUTURE SCOPE 7.1 CONCLUSION ✔ In conclusion, an agriculture crop recommendation system using machine learning provides a transformative approach to modern farming. By analyzing historical data, environmental factors, and market trends, such systems enable farmers to make informed decisions about crop selection, optimize resource utilization, and improve productivity. ✔ The integration of algorithms like Random Forest, Decision Trees, or Neural Networks ensures accurate predictions and tailored recommendations for specific regions and conditions. ✔ This technology not only increases agricultural efficiency but also contributes to sustainable farming practices by reducing waste and enhancing crop management. Ultimately, the adoption of such systems empowers farmers to achieve higher yields, improve profitability, and adapt to changing climatic and market conditions, fostering growth and resilience in the agricultural sector. 7.2 FUTURE SCOPE The system can be enhanced further to add the following functionalities: 1. Expanding the Dataset: The primary focus of future work is to improve the dataset by incorporating a larger number of attributes. This expansion will enable more comprehensive analysis, better accuracy in crop recommendations, and an increased ability to address diverse agricultural scenarios. 2. Crop Health Monitoring and Disease Classification: Future Dept. of CSE (AI & ML) 27 BCI586 Crop Recommendation System using ML enhancements include building a model capable of classifying healthy and diseased crop leaves. Additionally, the system will identify specific diseases affecting the crops, providing farmers with timely and accurate information for disease management. This functionality aims to reduce crop losses, optimize resource usage, and improve overall agricultural productivity. 3. Developing User-Friendly Interfaces: To ensure accessibility and ease of use, the system will include the development of a dedicated website and mobile application. These platforms will offer intuitive interfaces for farmers to access crop recommendations, monitor crop health, and receive actionable insights, enabling seamless integration into their farming practices. Dept. of CSE (AI & ML) 28 BCI586 Crop Recommendation System using ML REFERENCES [1] Aruvansh Nigam, Saksham Garg, Archit Agrawal ―Crop Yield Prediction using ML Algorithms ―, 2019 Fifth International Conference on Image Information Processing (ICIIP) [2] LeoBrieman, ―Random Forestsǁ, 2019 IEEE Transactions on Instrumentation and Measurement [3] Priya, P., Muthaiah, U., Balamurugan, M.ǁ Predicting Yield of the Crop Using Machine Learning Algorithmǁ,2020 International Journal of Engineering Sciences & Research Technology (IJESRT) [4] Mishra, S., Mishra, D., Santra, G. H.,―Applications of machine learning techniques in agricultural crop productionǁ,2020 Indian Journal of Science and Technology [5] Dr.Y Jeevan Kumar,ǁSupervised Learning Approach for Crop Productionǁ, 2020 5th International Conference on Communication and Electronics Systems (ICCES)4. [6] Medar, Ramesh, Vijay S. Rajpurohit, and Shweta Shweta. \"Crop yield prediction using machine learning techniques.\" In 2019 IEEE 5th International Conference for Convergence in Technology (I2CT), pp. 1-5. IEEE, 2019. [7] . Jain, Sonal, and Dharavath Ramesh. \"Machine Learning convergence for weather based crop selection.\" In 2020 IEEE International Students' Conference on Electrical, Electronics and Computer Science (SCEECS), pp. 1-6. IEEE, 2020. [8] Nidhi H Kulkarni, Dr. G N Srinivasan, Dr. B M Sagar, Dr.N K Cauvery, “Improving Crop Productivity Through A Crop Recommendation System Using Ensembling Technique”, IEEE, 2018. [9] Zeel Doshi, Subhash Nadkarni, Rashi Agrawal, Prof. Neepa Shah, “AgroConsultant: Intelligent Crop Recommendation System Using Machine Learning Algorithms”, IEEE, 2018. [10] Dr.A.K.Mariappan, Ms C. Madhumitha, Ms P. Nishitha and Ms S. Nivedhitha, “Crop Recommendation System through Soil Analysis Using Classification in Machine Learning”, IJAST, Volume 29, 2020. Dept. of CSE (AI & ML) 29",
  "skills": [
    "Python",
    "Rest",
    "Machine Learning",
    "Ai",
    "Numpy",
    "Pandas",
    "Flask",
    "Scala"
  ],
  "experience_years": null,
  "education": [
    "Bachelor",
    "Computer Science",
    "Engineering",
    "Bsc"
  ],
  "email": null,
  "similarity_score": 0.8347200453281403,
  "timestamp": "2025-11-28 15:58:43.093070"
}