{
  "id": "5327acd7-58ab-4858-83fa-6b87e93a8e95",
  "filename": "Jithu Final.pdf",
  "extracted_text": "VISVESVARAYA TECHNOLOGICAL UNIVERSITY Jnana Sangama, Belagavi – 590014 Technical Seminar Report on “ Developing an Agile Cybersecurity Framework” Submitted in the partial fulfillment of the requirements for the award of the Degree of Bachelor of Engineering in Computer Science and Engineering Submitted by M Jeethendra Reddy 1VA21CS029 Under the guidance of Prof. Syed Matheen Pasha Assistant Professor Department of CSE, SVIT DEPARTMENT OF COMPUTER SCIENCE & ENGINEERING SAI VIDYA INSTITUTE OF TECHNOLOGY (Affiliated to VTU, Belagavi, Approved by AICTE, New Delhi and Govt. of Karnataka) Accredited by NBA (CSE, ISE, ECE) & NAAC – ‘A’ Grade Rajanukunte, Bengaluru-560064 Tel: 080-2846 8196, Fax: 2846 8193 / 98, Web: saividya.ac.in 2024 - 2025 SAI VIDYA INSTITUTE OF TECHNOLOGY (Affiliated to VTU, Belagavi, Approved by AICTE, New Delhi and Govt. of Karnataka) Accredited by NBA (CSE, ISE, ECE) & NAAC – ‘A’ Grade Rajanukunte, Bengaluru-560064 Department of Computer Science and Engineering Certificate This is to certify that the Technical Seminar (21CS81) entitled “ Developing an Agile Cybersecurity Framework” was presented by M Jeethendra Reddy (1VA21CS026), a bonafide student of Sai Vidya Institute of Technology, Bangalore, in partial fulfillment for the award of Bachelor of Engineering in Computer Science and Engineering of Visvesvaraya Technological University, Belagavi during the year 2024-2025. It is certified that all corrections/suggestions indicated for Internal Assessment have been incorporated in the report. The seminar report has been approved as it satisfies the academic requirements in respect of seminar work prescribed for the said degree. …………………………………………. …………………………………… Dr. Varun E Prof. Syed Matheen Pasha Associate Professor Assistant Professor Technical Seminar Coordinator Technical Seminar Guide Department of CSE Department of CSE ………………………. ………………………………. Dr. Shashikumar D R Dr. M S Ganesha Prasad Professor & HOD, Principal Department of CSE ACKNOWLEDGEMENT The completion of Technical Seminar brings with and sense of satisfaction, but it is never completed without thanking the persons who are all responsible for its successful completion. First and foremost, I wish to express our deep sincere feelings of gratitude to my Institution, Sai Vidya Institute of Technology, for providing me an opportunity to do our education. I would like to thank the Management and Prof. M R Holla, Director, Sai Vidya Institute of Technology for providing the facilities. I extend my deep sense of sincere gratitude to Dr. M S Ganesha Prasad, Principal, Sai Vidya Institute of Technology, Bengaluru, for having permitted to carry out the Technical Seminar successfully. I am thankful to Prof. A M Padma Reddy, Additional Director, Professor and Dean (Student affairs), Department of Computer Science and Engineering(Data Science), Sai Vidya Institute of Technology, for his constant support and motivation. I express my heartfelt sincere gratitude to Dr. Shashikumar D R, Professor and HOD, Department of Computer Science and Engineering, Sai Vidya Institute of Technology, Bengaluru, for his valuable suggestions and support. I express my sincere gratitude to Prof. Syed Matheen Pasha, Assistant Professor, Technical Seminar Guide, Department of Computer Science and Engineering, Sai Vidya Institute of Technology, Bengaluru, for her constant support. I also like to thank technical seminar coordinator Dr. Varun E. Associate Professor, Department of Computer Science and Engineering, Sai Vidya Institute of Technology, Bengaluru, for his coordination. Finally, I would like to thank all the Teaching, Technical faculty of Department of Computer Science and Engineering, Sai Vidya Institute of Technology, Bengaluru, for their support. M Jeethendra Reddy (1VA21CS029) ABSTRACT Cyberattacks are increasingly sophisticated and persistent, posing serious threats to organizations across all sectors by compromising data security, disrupting operations, and inflicting considerable financial and reputational damage. A fundamental issue contributing to this vulnerability is the misinterpretation and flawed implementation of existing cybersecurity frameworks. These frameworks often prioritize technological solutions while overlooking the crucial role of human behavior and organizational culture. As a result, cybersecurity implementations tend to be rigid, slow to adapt, and misaligned with the dynamic threat landscape. This overreliance on technology without integrating human-centric strategies significantly weakens an organization’s ability to proactively prevent, detect, and respond to cyber threats. To address these shortcomings, this study introduces a novel agile cybersecurity framework that emphasizes the integration of technology with organizational culture. Utilizing Q methodology, which captures and analyzes expert opinions, the study draws insights from a systematic literature review and expert consultations to identify five core components essential for effective cybersecurity: Security Governance, Risk Management, Incident Management, Security Technology, and Organizational Culture. The proposed framework adopts an agile approach by combining elements of the Dynamic Systems Development Model (DSDM) and Feature-Driven Development (FDD), promoting adaptability, iterative development, and continuous stakeholder engagement. This agile, integrated framework aims to enhance the responsiveness and resilience of cybersecurity practices, optimize human factors within organizations, and ultimately reduce the impact and frequency of cyberattacks through a more flexible and inclusive defense strategy. Table of Contents ACKNOWLEDGEMENT ............................................................................................... I ABSTRACT ................................................................................................................... II TABLE OF CONTENTS ............................................................................................. III LIST OF FIGURES ....................................................................................................... V CHAPTER 1 INTRODUCTION .......................................................................................................... 1 1.1 Introduction ................................................................................................................ 1 1.2 Literature Survey ........................................................................................................ 3 1.3 Objectives ................................................................................................................... 6 CHAPTER 2 SYSTEM DESIGN.......................................................................................................... 8 2.1 TBlockchain Class ...................................................................................................... 8 2.2 Goals of the System Design…………………………………………………………….8 2.3 Components of the Proposed System…………………………………………………..9 2.4 System Workflow……………………………………………………………………..10 2.5 Design Considerations………………………………………………………………...11 2.6 Future-Readiness of the Framework…………………………………………………..11 CHAPTER 3 DEPLOYMENT ............................................................................................................ 12 3.1 Deployment Objectives……………………………………………………………….12 3.2 Deployment Strategy………………………………………………………………….13 3.3 Challenges Faced During Deployment………………………………………………..16 3.4 Key Outcomes…………………………………………………………………………16 CHAPTER 4 APPLICATIONS .......................................................................................................... 17 Table of Contents CHAPTER 5 ADVANTAGES AND DISADVANTAGES ................................................................. 19 5.1 Advantages ............................................................................................................... 19 5.2 Disadvantages ........................................................................................................... 20 CHAPTER 6 CONCLUSION ............................................................................................................. 22 REFERENCES ............................................................................................................. 23 List of Figures Figure 2.1 Proposed Agile Cybersecurity Framework 7 Figure 2.2 Stages of Construction of the Framework 8 Figure 3.1 Stages of the Q Methodology Process 12 “Developing an Agile Cybersecurity” Framework\" CHAPTER 1 INTRODUCTION 1.1 Introduction In an era dominated by digital technologies, cybersecurity is no longer a technical issue restricted to IT departments—it is a strategic concern for all organizational stakeholders. As cyber threats grow in frequency and sophistication, traditional security models, which are often rigid and focused primarily on technical controls, struggle to address emerging challenges. These models frequently neglect the importance of human factors and organizational culture, both of which significantly influence cybersecurity effectiveness. The growing reliance on interconnected systems, cloud computing, mobile devices, and remote work environments has expanded the attack surface, making organizations more vulnerable than ever. Threats such as phishing, ransomware, and insider attacks exploit not just technological weaknesses but also human behavior, highlighting the need for a comprehensive approach. Organizations today operate in complex environments where both internal vulnerabilities and external threats can cause significant disruptions to business continuity. Moreover, cybersecurity incidents are not just technical breaches—they often result in reputational damage, legal liabilities, financial losses, and erosion of customer trust. Therefore, cybersecurity should be viewed not only as an IT responsibility but as a cross- functional imperative involving leadership, human resources, operations, and end-users. This broader perspective necessitates a framework that transcends conventional defenses and incorporates adaptive, people-centered strategies. The role of organizational culture is pivotal in shaping employee attitudes and responses to cybersecurity policies. A culture that promotes awareness, accountability, and proactive behavior can significantly enhance the effectiveness of cybersecurity programs. Conversely, a disengaged or unaware workforce can unintentionally become the weakest link in the security chain. Hence, aligning cybersecurity practices with the values, beliefs, and behavioral patterns of organizational members is essential. Department of CSE, SVIT, Bengaluru 2024-25 Page 1 “Developing an Agile Cybersecurity” Framework\" Agile methodologies, originally developed for software engineering, emphasize collaboration, flexibility, iterative development, and continuous feedback. When applied to cybersecurity, these principles support a more responsive and resilient defense mechanism capable of adapting to emerging threats. Agile frameworks encourage open communication, empower teams to make quick decisions, and promote frequent reassessment of risks and strategies. This technical seminar report introduces a novel approach to cybersecurity—one that is agile, adaptive, and inclusive of the organizational cultural context. The report draws from a recent IEEE study that integrates agile methodologies with cultural awareness using Q methodology, a research tool designed to systematically capture subjective viewpoints. This combination enables organizations to develop security frameworks that are dynamic and responsive to internal cultural dynamics as well as external threats. Q methodology helps to identify and categorize the various perspectives individuals within an organization hold toward cybersecurity. This allows leaders to tailor security initiatives that are not only technically sound but also culturally resonant, thereby increasing user engagement and policy adherence. Understanding these perceptions also aids in pinpointing areas where resistance or misunderstanding may arise, facilitating more effective change management. Agile cybersecurity emphasizes continuous improvement through iterative cycles, stakeholder collaboration, and rapid response to changes in the threat landscape. By embedding these agile principles within an organization’s culture, cybersecurity can evolve from a reactive model to a proactive one. This transformation allows for the creation of security protocols and policies that resonate with employee values, behaviors, and work practices, thereby improving compliance and reducing risk. Additionally, the integration of organizational culture into cybersecurity planning fosters a sense of ownership among employees. When staff members understand the rationale behind security measures and see their feedback incorporated into policy decisions, they are more likely to support and adhere to these initiatives. This participative approach not only boosts morale but also strengthens the organization's overall security posture. Department of CSE, SVIT, Bengaluru 2024-25 Page 2 “Developing an Agile Cybersecurity” Framework\" By understanding how different individuals within an organization perceive cybersecurity and by recognizing the influence of shared values and beliefs, the proposed framework aims to create a resilient security posture that is sustainable in the long term. This approach emphasizes stakeholder collaboration, continuous improvement, and flexibility—key principles derived from agile methodology. It also advocates for the alignment of security strategies with organizational behaviors, ultimately leading to more effective risk mitigation and enhanced compliance. In summary, this report serves as a foundation for exploring the integration of agile methodologies and organizational culture in cybersecurity strategy. It highlights the importance of holistic thinking and inclusive engagement in building a resilient digital environment. The following sections provide a comprehensive analysis of the background, methodology, key findings, proposed framework, conclusions, and recommendations based on the study. This structured approach enables seminar participants to appreciate the multifaceted nature of cybersecurity and the critical role of organizational culture in shaping secure practices. 1.2 Literature Survey Cybersecurity has become a critical concern in modern digital ecosystems due to the increasing frequency and sophistication of cyber-attacks. Traditional cybersecurity frameworks tend to focus heavily on technical controls, such as firewalls, intrusion detection systems, and encryption mechanisms. While these are essential, they often neglect the dynamic and human-centric aspects of organizations—such as adaptability, communication, and culture. As a result, researchers have started exploring more holistic approaches that integrate agile methodologies and organizational culture into cybersecurity strategy. Agile Practices in Cybersecurity Agile methodologies, originally formulated for software development (e.g., Scrum, XP, Kanban), emphasize flexibility, continuous feedback, and iterative progress. The dynamic nature of cybersecurity threats requires similar principles: fast responses, adaptability, and continuous improvement. Literature suggests that applying agile practices to cybersecurity enhances an organization’s ability to detect threats early, respond to incidents efficiently, and evolve its security posture over time. Department of CSE, SVIT, Bengaluru 2024-25 Page 3 “Developing an Agile Cybersecurity” Framework\" A study by Sion et al. (2019) emphasized the importance of DevSecOps (Development, Security, and Operations) in integrating security into the software development life cycle, reflecting agile values. In such settings, security is no longer an afterthought but a continuous, integral process involving all stakeholders. Agile security teams conduct regular retrospectives to improve defenses, perform automated security testing in CI/CD pipelines, and prioritize threat modeling during sprint planning. Moreover, agile approaches foster better communication and collaboration between security teams and other departments. This helps reduce the “security as a bottleneck” perception and promotes a shared responsibility model where every employee contributes to maintaining a secure environment. Organizational Culture and Cybersecurity Behavior Organizational culture refers to the shared values, beliefs, and behaviors within an organization. It shapes how employees perceive and respond to cybersecurity policies, risks, and incidents. A culture that promotes transparency, accountability, and awareness is more likely to support successful cybersecurity implementations. Research by Schein (2010) and later by Ifinedo (2014) underlines that technical solutions alone cannot ensure cybersecurity. Employees' attitudes and behaviors play a crucial role in safeguarding information assets. For instance, even the best technical system can be compromised by a user falling victim to a phishing attack. Thus, building a cybersecurity- aware culture becomes critical. Several frameworks, such as the National Institute of Standards and Technology (NIST) Cybersecurity Framework, now recommend the inclusion of organizational and cultural considerations alongside technical measures. Cultural elements like leadership support, employee training, and motivation can significantly influence cybersecurity policy adherence and risk management outcomes. Department of CSE, SVIT, Bengaluru 2024-25 Page 4 “Developing an Agile Cybersecurity” Framework\" Q Methodology in Cybersecurity Research Q methodology is a research tool that combines qualitative and quantitative techniques to systematically study people’s subjective experiences and viewpoints. It has become increasingly valuable in exploring cybersecurity-related perceptions in organizations. In the context of cybersecurity, Q methodology enables researchers to gather and analyze how different stakeholders—such as employees, managers, or IT staff—view issues like risk, trust, and compliance. By identifying shared perspectives or “factors,” organizations can design tailored interventions that align with actual employee attitudes rather than relying on assumptions. For example, a study by Addae et al. (2020) used Q methodology to explore employee attitudes toward information security policies. The results revealed that while some employees were motivated by personal responsibility, others complied due to fear of consequences. Such insights help organizations craft targeted awareness programs, enforce realistic policies, and reduce resistance to security measures. Integrating Agile, Culture, and Q Methodology Recent literature supports the idea that combining agile principles with a deep understanding of organizational culture, supported by Q methodology, can significantly enhance cybersecurity frameworks. Agile methodologies contribute the necessary speed and adaptability, while cultural insights ensure employee buy-in and realistic implementation. Q methodology serves as a bridge, helping to uncover subjective beliefs that may otherwise remain hidden. Department of CSE, SVIT, Bengaluru 2024-25 Page 5 “Developing an Agile Cybersecurity” Framework\" 1.3 Objectives The increasing complexity and dynamism of cyber threats have revealed critical limitations in traditional cybersecurity frameworks, particularly their static nature and lack of alignment with human factors within organizations. This study seeks to bridge the gap between technical solutions and human behavior by designing a comprehensive cybersecurity framework that is agile, culturally aware, and rooted in empirical analysis using Q methodology. The goal is to develop a proactive, adaptive, and people-centric approach to cybersecurity that evolves alongside organizational needs and threat landscapes. To Analyze Limitations in Traditional Cybersecurity Frameworks Traditional security systems often rely on static protocols and centralized control, making them slow to respond to rapidly evolving cyber threats. This objective involves critically examining existing frameworks like NIST, ISO 27001, and CIS to identify weaknesses in flexibility, adaptability, and cultural fit. The study will assess how rigid compliance models can lead to user resistance, policy circumvention, and slower threat response times. To Integrate Agile Methodologies into Cybersecurity Operations Agile practices emphasize continuous improvement, responsiveness, and collaboration— qualities that are now essential in cybersecurity. This objective aims to introduce agile principles (e.g., sprints, stand-up meetings, iterative assessments) into cybersecurity planning and incident response workflows. The goal is to transition from reactive to proactive security postures, enabling faster adaptation to new threats and smoother collaboration across technical and non-technical departments. To Investigate the Influence of Organizational Culture on Cybersecurity Behavior Culture plays a central role in how security practices are perceived and adopted. This objective focuses on exploring how various cultural dimensions—such as leadership style, communication norms, risk perception, and employee attitudes—affect cybersecurity compliance and awareness. A security policy that aligns with organizational values is more likely to be accepted and followed. Department of CSE, SVIT, Bengaluru 2024-25 Page 6 “Developing an Agile Cybersecurity” Framework\" To Apply Q Methodology for Perception Analysis Q methodology is uniquely suited for capturing and analyzing subjective opinions and attitudes. This objective involves using Q-sorting techniques to collect data from stakeholders (employees, managers, security teams) about their views on cybersecurity policies, threats, and responsibilities. By identifying common perspectives, the study will reveal which cultural or behavioral factors are helping or hindering security effectiveness. To Design a Hybrid Framework Combining Agile, Cultural, and Perceptual Insights Based on the findings from the above objectives, this study will develop a novel cybersecurity framework that merges agile process models with organizational culture considerations. The Q methodology results will be used to tailor the framework to real-world user attitudes and behaviors, making it both technically sound and practically implementable across diverse industries. To Promote Security Awareness and a Collaborative Cybersecurity Culture A crucial part of cybersecurity is ensuring that employees are informed, engaged, and motivated to protect digital assets. This objective aims to create recommendations for security awareness programs, leadership practices, and team collaboration models that build a resilient security culture across all organizational levels. To Evaluate and Validate the Proposed Framework This final objective involves applying the proposed framework in simulated or real-world case studies to assess its effectiveness. Metrics such as response time to incidents, employee compliance rates, user feedback, and overall system resilience will be used to validate the model. Feedback from stakeholders will help refine the framework and assess its scalability across different organizational contexts. Department of CSE, SVIT, Bengaluru 2024-25 Page 7 “Developing an Agile Cybersecurity” Framework\" CHAPTER 2 SYSTEM DESIGN 2.1 Introduction to System Design The design of an agile, human-centric cybersecurity framework requires a structured yet flexible approach that integrates behavioral science, organizational culture, and adaptive security practices. Traditional security systems often fail because they treat users as passive participants rather than active contributors. The proposed system is uniquely designed to respond to the dynamic nature of cyber threats by continuously evolving through user feedback, cultural awareness, and agile principles. Fig 2.1 Proposed Agile Cybersecurity Framework 2.2 Goals of the System Design  To create a resilient cybersecurity framework that evolves continuously through agile iterations.  To integrate Q methodology for understanding and segmenting employee behavior and perception towards cybersecurity.  To align security policies with organizational culture, ensuring high adoption and minimal resistance.  To develop a feedback-driven loop w/here every sprint brings improvements based on cultural and operational insights. Department of CSE, SVIT, Bengaluru 2024-25 Page 8 “Developing an Agile Cybersecurity” Framework\" 2.3 Components of the Proposed System The proposed framework includes five interconnected layers: Fig 2.2 Stages of construction the framework formulated through systematic literature reviews (SLR) 1. User Perception & Culture Identification Layer Purpose: To gather subjective data about how users perceive cybersecurity within their work environment. Input Mechanism: Q-sorting exercises: Users sort statements related to cybersecurity attitudes. Cultural assessments: Surveys based on Hofstede’s cultural dimensions or Schein’s cultural model. Output: Behavioral clusters (e.g., “proactive users,” “policy avoiders,” “indifferent users”). 2. Q Methodology Analysis Engine Purpose: To interpret user-sorted data using factor analysis and correlation techniques. Features: Uses correlation matrices to identify patterns in viewpoints. Groups users into typologies based on their cognitive stance on cybersecurity (e.g., trust in IT, fear of consequences, belief in policy efficiency). Outcome: A user map that influences how the rest of the framework responds. 3. Agile-Based Cybersecurity Execution Layer Purpose: To manage security tasks with agility and responsiveness. Key Practices: Sprint-based planning and execution. Department of CSE, SVIT, Bengaluru 2024-25 Page 9 “Developing an Agile Cybersecurity” Framework\" Security incidents handled as backlog items. Scrum or Kanban boards for visualizing tasks. DevSecOps pipeline for secure software deployment. Benefits: Promotes quick iterations and continuous deployment of security features. Encourages collaboration between security teams, developers, and non-technical staff. 4. Organizational Culture Alignment Layer Purpose: To design policies and awareness programs that reflect organizational values and user psychology. Approach: Tailor policies to each employee group based on Q methodology findings. Include leadership in policy communication to reinforce cultural legitimacy. Incorporate nudging techniques, gamification, or storytelling to change behavior. Goal: High engagement and low resistance from employees. 5. Feedback, Learning, and Evolution Layer Purpose: To monitor framework effectiveness and implement changes based on performance. Tools: Retrospective meetings after every sprint. Behavioral metrics: login behaviors, response to phishing simulations, training completion rates. Incident analytics: root cause analysis, time to detect/respond. Outcome: Continuous improvement loop that evolves with the organization's needs and external threat landscape. Department of CSE, SVIT, Bengaluru 2024-25 Page 10 “Developing an Agile Cybersecurity” Framework\" 2.4 System Workflow Here’s a detailed step-by-step process of how the system functions: Initialization Phase Define objectives and scope of implementation. Establish a cross-functional agile security team. Conduct baseline culture and risk assessments. Q Methodology Application Develop a set of cybersecurity-related statements. Ask participants to rank these statements using Q-sorting grids. Perform statistical analysis to extract factors and identify behavior groups. 2.5 Design Considerations Human-Centric: Respects psychological and cultural dimensions, not just technical. Iterative and Flexible: Supports continuous evolution through agile mechanisms. Customizable: Can be adapted for startups, enterprises, or government settings. Secure and Ethical: All user data from Q methodology is anonymized and used solely for improving engagement. 2.6 Future-Readiness of the Framework This framework is designed to be forward-compatible. As cyber threats grow in complexity— AI-generated phishing, deepfakes, ransomware-as-a-service—organizations need to think beyond antivirus and firewalls. The proposed system ensures that: Policies are living documents, not static checklists. Users are co-creators, not passive policy followers. Security becomes cultural, not just procedural. Department of CSE, SVIT, Bengaluru 2024-25 Page 11 “Developing an Agile Cybersecurity” CHAPTER 3 DEPLOYMENT The deployment phase is a critical bridge between the theoretical design of the agile cybersecurity framework and its real-world implementation. This phase focuses not only on technological integration but also on the cultural and behavioral alignment of users within an organization. Traditional cybersecurity deployments often emphasize hardware and software installations. In contrast, this framework introduces adaptive deployment through Agile methodology, where employees, their cultural perceptions, and behavioral patterns play a central role in shaping the final outcome. This chapter explains how the cybersecurity framework is deployed in stages, how Q methodology results influence deployment decisions, and how feedback loops help sustain long-term security awareness and compliance. 3.1 Deployment Objectives The deployment phase is designed to achieve the following long-term and short-term objectives: Short-Term Objectives: Initiate a pilot program for testing the framework in a real department.Evaluate employee responses to personalized training modules based on Q methodology.Implement essential security tools such as multi-factor authentication (MFA), firewalls, and patch management systems. Long-Term Objectives: Establish an organization-wide agile security culture where security is embedded into daily operations.Integrate cultural and behavioral feedback mechanisms to continuously improve policies and procedures.Create an autonomous, learning security system that evolves with employee needs and external threats. Department of CSE, SVIT, Bengaluru 2024-25 Page 12 “Developing an Agile Cybersecurity” 3.2 Deployment Strategy The framework is deployed in five incremental and agile-driven phases, each building upon insights from the previous one. The agile model ensures that mistakes are identified early and corrected iteratively, rather than deploying a fixed, rigid security model. Fig 3.1 The stages of the Q Methodology Process are delineated into four sequential phases Phase 1: Pre-Deployment Preparation In this phase, foundational work is carried out to ensure the organization is ready to adopt an agile, culture-based cybersecurity model. Key Activities: Stakeholder Identification:Security experts, IT personnel, HR managers, cultural analysts, and department heads are engaged early.Executive sponsorship is secured to promote top- down support for cultural change. Infrastructure Assessment:Current security tools, policies, network architecture, and vulnerabilities are assessed.A gap analysis is performed to identify what must be upgraded or replaced. Cultural Mapping and Q Data Collection:Q-sorting activities are initiated with employees.Each user ranks a set of cybersecurity-related statements (e.g., “I believe cybersecurity is everyone’s responsibility”).Behavioral patterns are extracted to understand resistance points and motivational triggers. Department of CSE, SVIT, Bengaluru 2024-25 Page 13 “Developing an Agile Cybersecurity” Phase 2: Agile Team Formation & Sprint Planning Agile deployment starts with forming a multidisciplinary team and planning the first sprint (2–4 weeks). Key Actions: Agile Team Setup:Roles include Scrum Master, Product Owner (security lead), cultural liaison (from HR), and Q methodology analyst.Security issues are treated like “user stories” (e.g., “As an employee, I want secure login access with minimal delay.”) Backlog Creation:Tasks such as firewall rule updates, vulnerability scans, and awareness campaigns are added to the backlog.Sprint Goals Defined:Example sprint goal: “Customize phishing awareness training for employee clusters identified in Q analysis.” Phase 3: Pilot Sprint Deployment A controlled rollout is conducted in one department to test framework behavior in a real environment. Pilot Activities:Security Control Deployment:Technical tools like MFA, antivirus upgrades, and access restrictions are deployed. Cultural Engagement:Group-specific training modules are introduced based on Q clusters (e.g., cautious users get practical examples; skeptics receive technical data).Peer champions are identified to act as local security ambassadors. Feedback Collection:Pre/post-training quizzes, perception surveys, and focus groups are used to gather feedback.Agile retrospective meetings are conducted to understand what worked and what needs improvement. Phase 4: Organization-Wide Rollout Once validated in the pilot department, the framework is expanded to all departments. Key Considerations: Policy Customization: Each team receives policies suited to their behavior type.Non- technical users get simplified checklists, while IT-heavy teams receive detailed policies. Department of CSE, SVIT, Bengaluru 2024-25 Page 14 “Developing an Agile Cybersecurity” Management Involvement: Managers actively participate in training to show commitment.Leadership sends regular communications reinforcing cultural values (e.g., integrity, vigilance, responsibility). Phase 5: Monitoring and Continuous Deployment Deployment does not end with installation. The system continues to evolve. Key Features: Dashboards & Metrics:Real-time dashboards track incidents, training completion rates, phishing test results, and behavioral improvement. Ongoing Sprints:New vulnerabilities, audit findings, or behavior shifts initiate new sprint cycles.Continuous improvement is embedded in the workflow. Knowledge Sharing:A shared internal wiki or LMS is maintained with guides, FAQs, and success stories. Category Tool/Technology Purpose Agile Project Jira, Trello Sprint tracking, backlog Management management Q Methodology PQMethod,Ken-QAnalysis Factor analysis, Q-sort clustering Awareness Training KnowBe4,CyberHootPhishing cultural alignment simulations Communication Slack, Microsoft Teams Teamcollaboration, policy updates Technical Controls and MFA, Firewall, Endpoint Prevent unauthorized malware Protection access ELK Stack, SIEM, Splunk Monitoring Log analysis, anomaly detection Table 3.1 : Tools and Technologies Used Department of CSE, SVIT, Bengaluru 2024-25 Page 15 “Developing an Agile Cybersecurity” 3.3 Challenges Faced During Deployment Behavioral Inertia:Many employees were resistant to change due to past negative experiences or a lack of understanding. Customization Complexity:Q methodology revealed diverse mindsets, requiring unique training formats for each group. Integration Delays:Aligning agile sprints with ongoing business operations required fine- tuning. Data Sensitivity:Cultural and perception data from Q-sorting had to be anonymized and secured to build trust. 3.4 Key Outcomes Measurable Culture Shift:Post-deployment surveys showed increased employee confidence in handling cybersecurity issues. Improved Security Posture:Early detection of vulnerabilities and rapid incident response became standard practices. Enhanced User Engagement:Employees participated actively in security feedback loops and retrospectives.Reduction in Human-Error Incidents:Targeted training led to fewer phishing clicks and stronger password practices. The deployment process demonstrated how a behaviorally intelligent and agile security model can be implemented effectively. Unlike static security solutions, this approach responds to the cultural DNA of the organization. It empowers users, enhances agility, and builds a collaborative ecosystem where cybersecurity becomes a shared responsibility. Continuous iteration and cultural feedback ensure that the system remains relevant ,scalable, and secure in the face of evolvingthreats. Department of CSE, SVIT, Bengaluru 2024-25 Page 16 “Developing an Agile Cybersecurity” CHAPTER 4 APPLICATIONS This chapter outlines real-world and research applications of AI across various domains. It provides a landscape of where AI has succeeded, what challenges it faces, and where it's being actively developed. 1. Game Playing Early AI success stories (e.g., Deep Blue beating Kasparov in chess). Current advances include AlphaGo, OpenAI Five, and StarCraft agents. Importance of perfect vs. imperfect information games. 2. Natural Language Processing (NLP) Tasks: speech recognition, machine translation, sentiment analysis. Tools: statistical models, neural networks, large language models like GPT. Challenges: ambiguity, context understanding, and pragmatics. 3. Robotics AI-driven robots operate in structured (factories) and unstructured (homes, hospitals) environments. Tasks: navigation, manipulation, object recognition, and planning. Key technologies: SLAM (Simultaneous Localization and Mapping), reinforcement learning, and computer vision. 4. Expert Systems Knowledge-based systems that emulate decision-making of human experts. Example: MYCIN (medical diagnosis), DENDRAL (chemical analysis). Struggles with brittleness and maintenance of large rule sets. Department of CSE, SVIT, Bengaluru 2024-25 Page 17 “Developing an Agile Cybersecurity” 5. Autonomous Vehicles’ Self-driving cars integrate perception, prediction, planning, and control. Uses a combination of computer vision, sensor fusion (LIDAR, radar), and deep learning. Legal, ethical, and safety concerns are critical barriers. 6. Machine Learning Applications Supervised, unsupervised, and reinforcement learning used in: Fraud detection Recommendation systems Image and speech recognition Deep learning breakthroughs significantly enhanced vision and language tasks. 7. Healthcare AI supports diagnosis, prognosis, personalized treatment, and drug discovery. Radiology, genomics, and pathology benefit from AI image and data analysis. Emphasis on transparency, fairness, and explainability. 8. Education Intelligent tutoring systems (ITS), automated grading, and personalized learning paths. AI can adapt content to individual student performance and engagement. 9. Finance and Business Applications in trading, portfolio management, credit scoring, and customer support (e.g., chatbots). AI also aids in risk management and fraud detection. 10. Security and Surveillance Use of AI in facial recognition, behavior analysis, and cybersecurity. Ethical debates around surveillance and privacy. Department of CSE, SVIT, Bengaluru 2024-25 Page 18 “Developing an Agile Cybersecurity” CHAPTER 5 ADVANTAGES AND DISADVANTEGES 5.1 ADVANTAGES 1. Enhanced Responsiveness to Threats Agile cybersecurity promotes short development cycles (sprints) and frequent updates, enabling organizations to respond to cyber incidents faster than traditional static frameworks. New vulnerabilities can be patched rapidly, and countermeasures can be deployed in real time, reducing risk exposure. 2. Sector-Specific Flexibility The framework is not one-size-fits-all. It adapts to the needs of sectors like: Healthcare: addresses patient data protection and HIPAA compliance. Finance: focuses on fraud prevention and risk analytics. Education: secures digital learning platforms and student privacy. Government: supports national security and public trust. 3. Cultural Integration Increases Adoption By aligning cybersecurity practices with prevalent organizational cultures (e.g., Clanculture in universities, Hierarchy in government), the framework ensures that: Policies are respected, not resisted. Employees feel ownership over security outcomes. Security becomes part of the everyday workflow, not an external imposition. 4. Improved Cross-Functional Collaboration Agile frameworks promote interdepartmental cooperation, involving not only IT but also HR, legal, operations, and leadership. This collaboration fosters shared accountability and more robust, realistic policies that consider multiple perspectives. Department of CSE, SVIT, Bengaluru 2024-25 Page 19 “Developing an Agile Cybersecurity” 5. Scalable and Adaptive to Organizational Growth The framework grows with the organization: Startups can implement lightweight, agile-focused practices. Enterprises can embed agile governance at multiple layers. This adaptability makes it a long-term strategic asset rather than a temporary fix. 5.2 DISADVANTAGES 1. Cultural Resistance to Change Employees may resist new agile workflows if they conflict with traditional norms (e.g., in rigid hierarchy-driven organizations). Without strong leadership support, changes may be superficial or symbolic rather than truly integrated. 2. High Initial Investment of Time and ResourcesRequires: Cultural assessment (e.g., surveys, Q methodology). Training for agile tools (Scrum, Kanban). Technical upgrades to support continuous integration and deployment (CI/CD). These upfront costs can be a barrier, especially for smaller institutions. 3. Complexity in Implementation Combining agile methodology with cultural models adds multiple layers of complexity: Strategic planning Behavioral change management Agile process management A lack of expertise can result in conflicting priorities or incomplete adoption. Department of CSE, SVIT, Bengaluru 2024-25 Page 20 “Developing an Agile Cybersecurity” 4. Risk of Speed Compromising Security The focus on speed and agility might lead to incomplete testing, security shortcuts, or deployment of unverified tools in the name of iteration. Balancing velocity and vigilance becomes a challenge. 5. Difficulty in Measuring Cultural Impact Organizational culture is qualitative and subjective. Proving the direct correlation between culture type and cybersecurity outcome is complex and often debated. Success metrics may vary between departments and teams, making evaluation inconsistent. 6. Risk of Oversimplifying Culture Frameworks like the Competing Values Framework (CVF) categorize culture into neat types (Clan, Market, Hierarchy, Adhocracy). In reality, cultures are mixed and fluid, and trying to box them too rigidly may miss the nuances that affect behavior and compliance. Department of CSE, SVIT, Bengaluru 2024-25 Page 21 CHAPTER 6 CONCLUSION In an era where cyber threats are increasingly sophisticated and persistent, traditional cybersecurity models often fall short in terms of adaptability and user engagement. This research has proposed and explored a novel Agile Cybersecurity Framework (ACF) that integrates the principles of agile methodology with organizational culture theories, particularly the Competing Values Framework (CVF). The integration aims to create a cybersecurity approach that is not only technically sound but also socially sustainable and culturally resonant. The Agile component of the framework enables organizations to respond swiftly and effectively to new and evolving threats through iterative planning, rapid deployments, and continuous feedback loops. By incorporating agile tools such as sprints, stand-ups, backlogs, and retrospectives into cybersecurity planning and execution, organizations can ensure that security controls remain current, scalable, and responsive to dynamic risk environments. Despite these limitations, the proposed framework represents a progressive shift in cybersecurity thinking—from technology-first models to people-centered, adaptive approaches. It advocates for cybersecurity as not just a technical function but a cultural and organizational priority that demands alignment with human behavior, institutional values, and collaborative practice. In conclusion, this research contributes a holistic, interdisciplinary framework that merges agile agility with cultural awareness to elevate cybersecurity posture in modern organizations. It lays a strong foundation for future studies to build on, particularly in developing quantitative tools for cultural assessment, sector-specific agile adaptations, and longitudinal evaluations of implementation impact. As organizations continue to evolve in the face of digital transformation, frameworks like the ACF with cultural alignment will be instrumental in building resilient, secure, and adaptive enterprises. Department of CSE, SVIT, Bengaluru 2024-25 Page 22 “Developing an Agile Cybersecurity” REFERENCES [1] Alshaikh, M., Maynard, S. B., Ahmad, A., & Chang, S. (2016). An exploratory study of current organizational practices in information security governance in the context of Saudi Arabia. Information and Computer Security, 24(5), 486–504. [2] Ashenden, D., & Sasse, M. A. (2013). CISOs and organisational culture: Their own worst enemy? Computers & Security, 39, 396–405. [3] Bada, A., & Sasse, M. A. (2015). Cyber Security Awareness Campaigns: Why do they fail to change behaviour? [4] Da Veiga, A., & Martins, N. (2017). Defining and identifying dominant information security cultures and subcultures. Computers & Security, 70, 72–94. [5] arsons, K., Butavicius, M., Delfabbro, P., Epslin, C., & Lillie, M. (2015). Predicting susceptibility to social influence in phishing emails. [6] J. Srinivas, A. K. Das, and N. Kumar, “Government regulations in cyber security: Framework, standards and recommendations,” Future Generation Computer Systems, vol. 92, pp. 178–188, 2019. doi: 10.1016/j.future.2018.09.063. [7] K. Reegard, C. Blackett, and V. Katta, “The concept of cybersecurity culture,” in Proc. 29th European Safety and Reliability Conference (ESREL), 2019, pp. 4036– 4043. doi: 10.3850/978-981-11-2724-3_0761-cd. [8] L. Y. Connolly, M. Lang, J. Gathegi, and D. J. Tygar, “Organisational culture, procedural countermeasures, and employee security behaviour: A qualitative study,” Information & Computer Security, vol. 25, no. 2, pp. 118–136, 2017. doi: 10.1108/ICS-03-2017-0013. [9] A. Zabala, “qmethod: A package to explore human perspectives using Q methodology,” The R Journal, vol. 6, no. 2, p. 163, 2014. doi: 10.32614/rj-2014-032. [10] B. Kitchenham and P. Brereton, “A systematic review of systematic review process research in software engineering,” Information and Software Technology, vol. 55, no. 12, pp. 2049–2075, 2013. doi: 10.1016/j.infsof.2013.07.010. Department of CSE, SVIT, Bengaluru 2024-25 Page 23",
  "skills": [
    "React",
    "Aws",
    "Git",
    "Sass",
    "Ci/Cd",
    "Api",
    "Rest",
    "Machine Learning",
    "Ai",
    "Data Science",
    "Scala"
  ],
  "experience_years": null,
  "education": [
    "Bachelor",
    "Master",
    "Mba",
    "Computer Science",
    "Engineering"
  ],
  "projects": [],
  "email": null,
  "similarity_score": 0.8600194454193115,
  "timestamp": "2025-11-28 16:50:31.866632"
}