{
  "id": "5ca73cd7-712a-45ba-a7f5-fd8b036850ec",
  "filename": "jithu resume.pdf",
  "extracted_text": "M JEETHENDRA REDDY +91 7338078795 — mjeethendrareddy21@gmail.com — https://github.com/Jithu553/jithu.git Summary — Detail-oriented and innovative Software Engineer with a strong foundation in computer science and hands- on experience in software development and web technologies. Proven ability to design and implement efficient systems through coursework and academic projects. Eager to leverage programming skills in Python and Java, alongside strong problem-solving abilities and effective communication skills to contribute to tech-driven projects. Education Sai Vidya Institute of Technology (SVIT) 09/2021 – 07/2025 Bachelor of Engineering in Computer Science 8.8 CGPA Sri Vidyaniketan Pu College, SRIRAMNAGAR 07/2019 – 07/2021 Pre-University Education, PCMB 86% Skills Technical Skills: – Programming Languages: Python, Java, – Web Development: HTML, CSS, JavaScript – Database: MySQL Soft Skills: – Communication, Teamwork, Public Speaking, Project Management Projects Bike Rental management, Dbms Project – Designed and implemented a robust Bike Rental Management System using SQL and a relational database architecture. – Optimized workflows for inventory management, customer profiles, and rental operations to ensure seamless functionality. Canteen Menu system, Mini project – Designed and developed a user-friendly Canteen Menu Management System leveraging SQL and relational database concepts. – Enabled real-time updates, streamlined order tracking, and improved user interaction for menu operations. Malware Identification and Classification ,Final Year project -Created a deep learning-based framework using YOLOv5 for real-time malware detection. -Developed an interactive web-based frontend with Streamlit to facilitate easy analysis and visualization, significantly enhancing detection speed and accuracy. Leadership and Volunteer Experience 1. Oraganizing Member at Sanchalana 2022, BENGALURU 2. Volunteer at TechVidya 2023, Bengaluru 3. Head Coordinator at Sanchalana 2024, Bengaluru 4. Chair of IEEE SSIT Student Branch: ID: 98825761 5. Student Placement Coordinator CSE Department, SVIT Certificates QSpiders training certificate: Java, data structures and algorithms, Python. TNS Foundation Training Certificate: MySQL, Git, Core Java, Spring Boot, HTML, CSS, and soft skills. Certificate of Academic Excellence: Recognized in 2nd, 3rd, and 4th year. Final Year Project Exhibition: 3rd Prize Web Development Internship: CoderOne",
  "skills": [
    "Python",
    "Java",
    "Javascript",
    "Sql",
    "Mysql",
    "Git",
    "Html",
    "Css",
    "Ai",
    "Spring"
  ],
  "experience_years": null,
  "education": [
    "Bachelor",
    "Computer Science",
    "Engineering"
  ],
  "similarity_score": null,
  "timestamp": "2025-11-28 12:34:05.272783"
}