{
  "id": "bd48dbca-2bf4-43e5-ae91-cdb6af441095",
  "filename": "SoftwareEngineerIntern(2026Passouts).pdf",
  "extracted_text": "Role — So(ware Engineer Intern (2026 Passouts) Company Name Kalvium (Conducted by KodNest) Company Website https://kalvium.com/ Work Mode Hybrid Position Title Software Engineer Intern Salary Stipend: Rs. 20,000/Month (10% TDS Applicable) Job Location Bangalore Office Skill Sets Java, Python, Redis, Docker, Postgre, MySql, NoSql, React, Nodejs • 400 or more GitHub Commits in a Year and a minimum GitHub/LeetCode Criteria (Mandatory) • GitWeek Streak of 35 Weeks • Top 15% Rank in LeetCode. Qualification B.E/B.Tech/M.E/M.Tech Specialization CSE, IT, AI, ML, Data Science or Related. Year of passing 2026 Percentage 55% throughout academics with no active backlogs Gap in Education / Backlogs No Any Bond No Graduation Certificate or a formal certificate from College/University, Certificate Submission mentioning that the student has graduated will be required at the time of conversion to full time. Provisional/Training Period (if any) 6 Months of Internship Round 1: Group Discussion Interview Rounds Round 2: Technical Round (Virtual, through Google Meet) Round 3: Culture Fitment Discussion (Virtual, through Google Meet) Interview Type Virtual Interview Location Virtual Loca&on: Bangalore (On-site a0er joining full-4me) Interview Type: Virtual Company Details: Kalvium is an excep4onal startup with a mission to make the world's educa4on more relevant and engaging. Our flagship offering is India's BEST Undergrad program in Computer Science Engineering which is offered across 15+ Universi4es in Indi & abroad. We are backed by 30+ industry stalwarts like top execu4ves from Google, Microso0, Flipkart, and PhonePe, as well as luminaries of India's unicorn ecosystem like Anupam MiZal, Kunal Shah, Rahul Chari, and Ankit Bha4. We are on the lookout for passionate minds to champion our vision and join us on a journey to redefine the global tech educa4on landscape. About the Role Our client is hiring passionate and high-poten4al So0ware Engineer Interns who aspire to build impac]ul systems that enhance student learning and success. This role offers significant learning, ownership, and a pathway to a PPO based on performance. Eligibility • B.E/B.Tech/M.E/M.Tech — 2026 passouts • Specializa4ons: CSE / IT / AI / ML / Data Science or related • 55% throughout, with no ac4ve backlogs • Must be in 3rd/4th year and able to join internship from office post-gradua4on • Passionate about improving educa4on and eager to learn in a fast-paced environment. • Ability to own work, contribute ideas, collaborate, and solve real-world problems Required Skill Set • Proficiency in: Java, Python, Redis, Docker, PostgreSQL, MySQL, NoSQL, React, Node.js • GitHub/LeetCode Criteria (Mandatory) : - 400+ commits in the last year - 35+ weeks GitWeek streak - Top 15% Rank on LeetCode S&pend & Compensa&on • Internship S4pend: ₹20,000 per month (10% TDS applicable) • Post-conversion CTC: ₹7 LPA Fixed + ₹1.5 LPA Performance Bonus + ₹1.5 Lakh ESOPs (vested over 4 years) Internship Dura&on • 6 Months (or un4l gradua4on — whichever is later) • Possible PPO based on performance Interview Process (Virtual – Google Meet) • Round 1 - Group Discussion • Round 2 -Technical Interview • Round 3 - Culture Fit Discussion Responsibilities • Build and support impactful systems focused on student learning outcomes • Develop and maintain production-grade software • Contribute to CS-related learning tools, content, and authoring systems • Work closely with multiple teams to solve real problems Perks & Work Culture • High-intensity learning environment • Exposure to challenging real-world tech problems • Great team culture with growth-centric leadership • Chance to transform higher education at scale • Competitive compensation post-PPO BYOD Policy: Clients operates on a Bring Your Own Device (BYOD) policy. Employees are expected to use their own Laptops for work purposes.",
  "skills": [
    "Python",
    "Java",
    "Js",
    "React",
    "Nodejs",
    "Node.Js",
    "Docker",
    "Mysql",
    "Postgresql",
    "Redis",
    "Github",
    "Ml",
    "Ai",
    "Data Science"
  ],
  "experience_years": 4,
  "education": [
    "B.Tech",
    "M.Tech",
    "BSc",
    "MSc",
    "Engineering"
  ],
  "projects": [],
  "email": null,
  "similarity_score": null,
  "timestamp": "2025-11-30 09:01:03.392031"
}