{
  "id": "c9628a21-5dc8-4657-8b2b-9431ea48d572",
  "filename": "autoCV.pdf",
  "extracted_text": "Muddappa Desai Muddappadesai6@gmail.com — +91-9740932326 — LinkedIn: muddappa-desai Summary EnthusiasticandmotivatedJava Full Stack Developer (Fresher)withafocusonCyber Security. Skilled in building web applications using Java, Spring Boot, HTML, CSS, JavaScript, and SQL. Quick learner with strong problem-solving skills, eager to contribute to challenging projects and continuously expand technical expertise. Education 2022 – Present B.Tech in Computer Science and Engineering (Cyber Security) CGPA: 6.4 Presidency University, Bangalore 2019 – 2021 Pre-University Course (PUC), Science Stream Percentage: 87% Sri Vidyaneketan PU College, Gangavathi Internships Java Full Stack Intern Jun 2025 – Present Dhee Coding Lab, Bengaluru • Hands-onexperienceinJavaFullStackDevelopmentincludingSpringBoot,RESTAPIs,HTML/CSS/JavaScript, and MySQL. • Built scalable applications and participated in collaborative project tasks. Blockchain Technology Intern (Offer) Jul 2025 – Oct 2025 CodTech IT Solutions Pvt. Ltd., Hyderabad (Remote) • Selected for a 12-week online internship focusing on Blockchain Technology and decentralized systems. • Designed to enhance technical expertise, teamwork, and real-world problem-solving. Projects AI-enabled Water Well Predictor Developed an AI-based irrigation solution that regulates water release in micro-irrigation systems using real-time soil moisture monitoring. Implemented predictive algorithms to optimize crop water requirements, ensuring water conservation and improved agricultural yield. Job Recommendation System Jan 2025 – Mar 2025 Designed a job recommendation system with user profiles, dynamic job suggestions, and a responsive HTML/CSS UI. Integrated server-side logic for personalized results and scalable future enhancements. Skills Programming Languages Java, Python (Basics), C, SQL Web Technologies HTML, CSS, JavaScript, Bootstrap Frameworks Spring Boot, Hibernate, React (Basics) Databases MySQL, MongoDB (Basics) Tools Git, GitHub, Eclipse, VS Code Concepts OOP, REST APIs, Cyber Security Fundamentals 1",
  "skills": [
    "Python",
    "Java",
    "Javascript",
    "React",
    "Sql",
    "Mongodb",
    "Mysql",
    "Git",
    "Html",
    "Css",
    "Api",
    "Rest",
    "Ai",
    "Spring",
    "Scala"
  ],
  "experience_years": null,
  "education": [
    "Computer Science",
    "Engineering",
    "B.Tech"
  ],
  "projects": [],
  "email": "Muddappadesai6@gmail.com",
  "similarity_score": 0.8546751141548157,
  "timestamp": "2025-11-28 16:50:25.377100"
}