{
  "id": "d9e10bed-ee6f-4787-bc55-2217f7c1a1c9",
  "filename": "application.pdf",
  "extracted_text": "Government of India Indian Institute of Remote Sensing Indian Space Research Organisation ISO 9001:2008 Application for Internship - August 2025 Name K V VARDHAN Registration Number IIRS86038 Application Number IIRS202513614369185 Course Name External Student's Internship Programme Discipline External Student's Internship Essential Qualification Bachelor of Engineering Father's/Husband's/Guardian's K M VENKATE GOWDA Name Date of Birth October 4, 2004 Gender Male Mobile Number 6360446970 Alternate Contact Number Aadhaar Number 570843851017 Alternate Email Id Land Line Number Current Address Address infinity pg, banshankari layout, rajankunute Country India State Karnataka City Bengaluru Pincode 560064 Permanent Address Address chikkakurugodu, gauribidanur Country India State Karnataka City gauribidanur Pincode 561208 Percentage Board/Inst Qualificat Degree Major /Equivalen Year of itute/Univ Proof ion Name Subjects t % of Passing ersity CGPA * kannada, english, hindi, karnatakar High mathematic nataka SSLC 90.08 2020 School s, state science, board social science physics, department Intermedia chemistry, of pre PUC 80 2022 te mathematic university s, biology board sai vidya institute Graduation B.E. B.E 91.4 2026 of technoligy Post M.Sc. Graduation Internship Duration 2026-01- 2026-02- Days Month From To 01 28 Nominating Authority Name Dr. T G Manjunath Designation head of department, sai vidya institute of technology Department of computer science engineering (artificial intelligence & machine learning), Address sai vidya institute of technology, karnataka -560064 Attachments CV / Resume Submitted Aadhaar Card Identification Proof Submitted Signature Declaration by Competent Authority (To be filled, signed & stamped by Placement Officer / HoD / Registrar / Dean / Head of Institute of respective University / Institute / College) I, ___________________________________________ (Name of Competent Authority), __________________________ (Designation), ___________________________________________ (Name of University / Institute / College), hereby declare that __________________________ (Name of the Student), is a bonafide student of our University / Institute / College, and I/we nominate him/her for Internship / Summer Training / Project / Research Work at IIRS, Dehradun from ________________ to ________________ (Duration). During the Internship / Summer Training / Project / Research Work, the student will abide by all the Rules & Regulations of IIRS, including security rules & office decorum. In case of any violation of Rules & Regulations or misconduct, the permission for Internship / Summer Training / Project / Research Work will be withdrawn by the IIRS. Name, Signature & Stamp of Competent Date: __________________________ Authority: __________________________ General Information 1. Only Indian nationals are eligible for Internship/ Summer Training/ Project/ Research Work. 2. Students will be allowed depending on the available seats as well as willingness/ consent of IIRS faculty to guide/ supervise the student, based upon educational qualifications, subjects, academic record & duration of project and current involvement of IIRS Faculty. 3. The student should possess an aggregate of a minimum of 60% or a CGPA of 6.32 on a scale of 10 in the disciplines of Science/Technology. 4. Extension of the Internship period will not be entertained. 5. Confirmation letter will be send to the respective University/ Institute/ College by post and/or e-mail. 6. Duly filled applications along with signed & stamped declaration letter will only be considered. Incomplete applications will be rejected. 7. Students not selected will not be informed. 8. The minimum duration of Internship/ Summer Training/ Project/ Research Work at IIRS is 45 days and the maximum duration is one year. 9. Student should bring 03 passport size colour photograph, original copies of documents, valid photo ID proof issued by Govt. of India and ID card issued by Univ./Inst./College. 10. Application may be submitted twice in a year. Last dates for application submission are 31st Oct & 31st March of every calendar year. 11. Completely filled application along with documents should be sent to Group Head, Programme Planning & Evaluation Group, Indian Institute of Remote Sensing, 4, Kalidas Road, Dehradun – 248001.",
  "skills": [
    "Machine Learning",
    "Ai"
  ],
  "experience_years": null,
  "education": [
    "Bachelor",
    "Computer Science",
    "Engineering"
  ],
  "projects": [],
  "email": null,
  "similarity_score": 0.8471202254295349,
  "timestamp": "2025-11-28 16:23:53.081848"
}