{
  "id": "f944a6aa-0dbd-425c-b112-fb75a7c1ec30",
  "filename": "CV.pdf",
  "extracted_text": "A VISHNU PRIYA (cid:211) +91 8431265363 Vishnupriyasnd@gmail.com Summary Enthusiastic and motivated Computer Science (Data Science) student with a solid foundation in program- ming and problem-solving. Skilled in C, Java, Python, and MySQL with hands-on experience through academic projects in machine learning and data analysis. Strong team player with good communication skills, eager to learn new technologies and contribute to innovative projects in the IT industry. Education Rao Bahadur Y. Mahabaleswarappa Engineering College 2022 – Present B.E. in Computer Science (Data Science) CGPA: 7.2 Duddupudi Rankers Career Academy 2020 – 2022 Pre-University Course (PUC) 73% Duddupudi English Medium High School 2012 – 2020 High School (SSC) 78% Projects Diabetes Prediction using Machine Learning (Python) - Implemented a machine learning model to predict diabetes based on medical attributes. - Applied data preprocessing, feature selection, and classification algorithms for accurate results. - Visualized outcomes using Python libraries. Bank Loan Analysis - Analyzed customer data to identify loan eligibility patterns. - Used Python and SQL for data cleaning, processing, and querying. - Built visual dashboards for insights and reporting. Skills Technical Skills: C, Java, Python, MySQL Soft Skills: Communication, Teamwork, Problem-Solving Languages • English • Kannada • Telugu Hobbies & Interests • Dancing • Drawing -Doodling • Reading Books • Playing Volleyball and Badminton",
  "skills": [
    "Python",
    "Java",
    "Sql",
    "Mysql",
    "Rest",
    "Machine Learning",
    "Ai",
    "Data Science"
  ],
  "experience_years": null,
  "education": [
    "Computer Science",
    "Engineering",
    "Data Science"
  ],
  "projects": [],
  "email": "Vishnupriyasnd@gmail.com",
  "similarity_score": 0.819483608007431,
  "timestamp": "2025-11-28 16:20:04.664553"
}